# Pandas

Series - 1D,
DataFrame - 2D

In [1]:
data = {
    "names" : ["Rahul", "Samson", "Rohit", "Shreyas", "Dube",
               "Pandey", "Sundar", "Shardul", "Chahal", "Saini",
               "Bumrah"],
    "scores" : [45, 2, 60, 33, 5, 11, None, None, None, None, None],
    "average" : [50, 5, 45, 40, 10, 35, 30, 25, 20, 15, None]
}

In [2]:
import pandas as pd

In [3]:
pd.Series(data)

names      [Rahul, Samson, Rohit, Shreyas, Dube, Pandey, ...
scores     [45, 2, 60, 33, 5, 11, None, None, None, None,...
average        [50, 5, 45, 40, 10, 35, 30, 25, 20, 15, None]
dtype: object

In [4]:
data["average"]

[50, 5, 45, 40, 10, 35, 30, 25, 20, 15, None]

In [6]:
series = pd.Series(data["average"])

In [7]:
series

0     50.0
1      5.0
2     45.0
3     40.0
4     10.0
5     35.0
6     30.0
7     25.0
8     20.0
9     15.0
10     NaN
dtype: float64

In [8]:
series[0]

50.0

In [9]:
series[0:5]

0    50.0
1     5.0
2    45.0
3    40.0
4    10.0
dtype: float64

In [10]:
series.mean()

27.5

In [12]:
scores_series = pd.Series(data["scores"])

In [13]:
scores_series

0     45.0
1      2.0
2     60.0
3     33.0
4      5.0
5     11.0
6      NaN
7      NaN
8      NaN
9      NaN
10     NaN
dtype: float64

In [14]:
scores_series.isna()

0     False
1     False
2     False
3     False
4     False
5     False
6      True
7      True
8      True
9      True
10     True
dtype: bool

In [16]:
scores_series.dropna()

0    45.0
1     2.0
2    60.0
3    33.0
4     5.0
5    11.0
dtype: float64

In [17]:
scores_series

0     45.0
1      2.0
2     60.0
3     33.0
4      5.0
5     11.0
6      NaN
7      NaN
8      NaN
9      NaN
10     NaN
dtype: float64

In [18]:
scores_series.dropna(inplace = True)

In [19]:
scores_series

0    45.0
1     2.0
2    60.0
3    33.0
4     5.0
5    11.0
dtype: float64

In [22]:
df = pd.DataFrame(data)

In [21]:
pd.DataFrame(data["names"])

          0
0     Rahul
1    Samson
2     Rohit
3   Shreyas
4      Dube
5    Pandey
6    Sundar
7   Shardul
8    Chahal
9     Saini
10   Bumrah

In [23]:
df

      names  scores  average
0     Rahul    45.0     50.0
1    Samson     2.0      5.0
2     Rohit    60.0     45.0
3   Shreyas    33.0     40.0
4      Dube     5.0     10.0
5    Pandey    11.0     35.0
6    Sundar     NaN     30.0
7   Shardul     NaN     25.0
8    Chahal     NaN     20.0
9     Saini     NaN     15.0
10   Bumrah     NaN      NaN

In [24]:
df[0]

KeyError: 0

In [25]:
df[0:5]

     names  scores  average
0    Rahul    45.0     50.0
1   Samson     2.0      5.0
2    Rohit    60.0     45.0
3  Shreyas    33.0     40.0
4     Dube     5.0     10.0

In [26]:
df["names"]

0       Rahul
1      Samson
2       Rohit
3     Shreyas
4        Dube
5      Pandey
6      Sundar
7     Shardul
8      Chahal
9       Saini
10     Bumrah
Name: names, dtype: object

In [27]:
df["scores"]

0     45.0
1      2.0
2     60.0
3     33.0
4      5.0
5     11.0
6      NaN
7      NaN
8      NaN
9      NaN
10     NaN
Name: scores, dtype: float64

In [29]:
df[["names", "scores"]]

      names  scores
0     Rahul    45.0
1    Samson     2.0
2     Rohit    60.0
3   Shreyas    33.0
4      Dube     5.0
5    Pandey    11.0
6    Sundar     NaN
7   Shardul     NaN
8    Chahal     NaN
9     Saini     NaN
10   Bumrah     NaN

In [30]:
df[["names", "scores", "average"]]

      names  scores  average
0     Rahul    45.0     50.0
1    Samson     2.0      5.0
2     Rohit    60.0     45.0
3   Shreyas    33.0     40.0
4      Dube     5.0     10.0
5    Pandey    11.0     35.0
6    Sundar     NaN     30.0
7   Shardul     NaN     25.0
8    Chahal     NaN     20.0
9     Saini     NaN     15.0
10   Bumrah     NaN      NaN

In [31]:
df[["names", "average", "scores"]]

      names  average  scores
0     Rahul     50.0    45.0
1    Samson      5.0     2.0
2     Rohit     45.0    60.0
3   Shreyas     40.0    33.0
4      Dube     10.0     5.0
5    Pandey     35.0    11.0
6    Sundar     30.0     NaN
7   Shardul     25.0     NaN
8    Chahal     20.0     NaN
9     Saini     15.0     NaN
10   Bumrah      NaN     NaN

In [37]:
temp_series = df["names"] == "Rahul"

In [38]:
df[temp_series]

   names  scores  average
0  Rahul    45.0     50.0

In [39]:
df[df["names"] == "Rahul"]

   names  scores  average
0  Rahul    45.0     50.0

In [40]:
df["average"] >= 25

0      True
1     False
2      True
3      True
4     False
5      True
6      True
7      True
8     False
9     False
10    False
Name: average, dtype: bool

In [42]:
temp_df = df[df["average"] >= 25]

In [43]:
temp_df

     names  scores  average
0    Rahul    45.0     50.0
2    Rohit    60.0     45.0
3  Shreyas    33.0     40.0
5   Pandey    11.0     35.0
6   Sundar     NaN     30.0
7  Shardul     NaN     25.0

In [44]:
temp_df[["names", "average"]]

     names  average
0    Rahul     50.0
2    Rohit     45.0
3  Shreyas     40.0
5   Pandey     35.0
6   Sundar     30.0
7  Shardul     25.0